# Essential Functionalities

## Reindexing

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=["d", 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

- reindexing does not change the underlying dataframe.
- a new dataframe is created.

In [5]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

- method `ffill`: forward fill can be used to do some interpolation of filling of values when reindexing for missing values.

In [7]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

- With Datafram, reindex can alter the (row) index, columns, or both.
- When passed only a sequence, it reindexes the rows in the result

In [29]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [30]:
frame2 = frame.reindex(index=['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

- The columns can be reindexed with the `columns` keyword
- If a column is not present in the reindex, the data will be dropped from the result. for example: Utah is not present in df and hence when reindexing Utah becomes nan
- Another way to reindex based on the columns is to pass in the axis.

In [31]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [32]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [33]:
frame.reindex(states, axis='columns')

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [34]:
frame.reindex(states, axis=1)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

- Most preferred way to reindex is to use the `loc` operator

In [35]:
frame.loc[['a', 'd', 'c'], ['California', 'Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

## Dropping Entries from an Axis

In [36]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [37]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [38]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [39]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

- With DataFrame, index values can be deleted from either axis.

In [40]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
index=["Ohio", "Colorado","Utah","New York"],
columns=["one", 'two', 'three', 'four'])

In [41]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

- Calling `drop` with a sequence of labels will drop values from the row lables (axis 0)

In [42]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

- To drop lables from the columns, istead use the `columns` keyword

In [43]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [44]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [45]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## Indexing, Selection and Filtering

In [47]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [48]:
obj['b']

np.float64(1.0)

In [49]:
obj[1]

C:\Users\Najee\AppData\Local\Temp\ipykernel_12960\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

np.float64(1.0)

In [50]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [51]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [52]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [53]:
obj[[1,3]]

C:\Users\Najee\AppData\Local\Temp\ipykernel_12960\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [54]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [55]:
obj.loc[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

- The reason to prefer `loc` is because of the different treatment of integers when indexing with [].
- Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs ddepending on the data type of the index. For example:

In [56]:
obj1 = pd.Series([1,2,3], index=[2,0,1])
obj2 = pd.Series([1,2,3], index=['a','b','c'])

In [57]:
obj1

2    1
0    2
1    3
dtype: int64

In [58]:
obj2

a    1
b    2
c    3
dtype: int64

In [59]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [60]:
obj2[[0,1,2]]

C:\Users\Najee\AppData\Local\Temp\ipykernel_12960\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

- When using `loc`, the expression `obj.loc[[0,1,2]]` will fail when the index does not conatin integers.

In [61]:
obj2.loc[[0,1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

- Since `loc` operator indexes exclusively with labels, there is also an `iloc` operator that indexes exclusively with integers to work consistently whether or not the index conatins integers:

In [62]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [63]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

> We can also slice with labels, but it works differently from normal Python slicing in that the endpoint is inclusive

In [64]:
obj2.loc['b':'c']

b    2
c    3
dtype: int64

- Assigning values using these methods modifies the correspoding section of the Series

In [65]:
obj2.loc['b':'c'] = 5

In [66]:
obj2

a    1
b    5
c    5
dtype: int64

- Indexing into df retieves one or more columns either with a single value of sequence

In [67]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one','two','three','four'])

In [68]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [70]:
data[['two', 'one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
New York   13   12

In [71]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [72]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

- The row selection syntax `data[:2]` is provided as convenience.
- Passing a single or list to the [] operator selects columns

In [74]:
data[data < 5] = 0

In [75]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection on DataFrame with loc and iloc

In [76]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [78]:
data.loc[['Colorado', 'New York']]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

- We can combine both row and column selection in `loc` by seperating the selections with a comma

In [79]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

- We can perform similar selections with integers using `iloc`

In [80]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [81]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [82]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [83]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

- Both indexing functions work with slices in addition to single labels or list of labels

In [84]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [86]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

- Boolean arrays can be used with `loc` but not with `iloc`
- therefore, first we get the target df slice and then provide the boolean condition in the above example. 
- if we were using `loc` then the example is given below

In [87]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Pitfalls with chained indexing

In [88]:
data.loc[:, 'one'] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [89]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [90]:
data.loc[data.four > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

- common gotcha is to chain selecteions when assigning.
- the underlying df never gets updated becasuse we end up mutating a temp df.
- for example you can get a warning.

In [91]:
data.loc[data.three == 5]['three']=6

C:\Users\Najee\AppData\Local\Temp\ipykernel_12960\2593035704.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]['three']=6

In [92]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [93]:
data.loc[data.three==5, 'three'] = 6

In [94]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3